# FilterStringContains Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringContains Properties
FilterStringContains Class See Also
---
The FilterStringContains type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FilterStringRuleEvaluator.) |

# See Also
FilterStringContains Class
Autodesk.Revit.DB Namespace